analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/smon_regs.h
#define MXC_F_SMON_SECALM_EXTSTAT3_FL_POS              19 /**< SECALM_EXTSTAT3_FL Position */
#define MXC_F_SMON_SECALM_EXTSTAT3_FL                  ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSTAT3_FL_POS)) /**< SECALM_EXTSTAT3_FL Mask */

#define MXC_F_SMON_SECALM_EXTSTAT4_FL_POS              20 /**< SECALM_EXTSTAT4_FL Position */
#define MXC_F_SMON_SECALM_EXTSTAT4_FL                  ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSTAT4_FL_POS)) /**< SECALM_EXTSTAT4_FL Mask */

#define MXC_F_SMON_SECALM_EXTSTAT5_FL_POS              21 /**< SECALM_EXTSTAT5_FL Position */
#define MXC_F_SMON_SECALM_EXTSTAT5_FL                  ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSTAT5_FL_POS)) /**< SECALM_EXTSTAT5_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN0_FL_POS             24 /**< SECALM_EXTSWARN0_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN0_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN0_FL_POS)) /**< SECALM_EXTSWARN0_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN1_FL_POS             25 /**< SECALM_EXTSWARN1_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN1_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN1_FL_POS)) /**< SECALM_EXTSWARN1_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN2_FL_POS             26 /**< SECALM_EXTSWARN2_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN2_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN2_FL_POS)) /**< SECALM_EXTSWARN2_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN3_FL_POS             27 /**< SECALM_EXTSWARN3_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN3_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN3_FL_POS)) /**< SECALM_EXTSWARN3_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN4_FL_POS             28 /**< SECALM_EXTSWARN4_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN4_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN4_FL_POS)) /**< SECALM_EXTSWARN4_FL Mask */

#define MXC_F_SMON_SECALM_EXTSWARN5_FL_POS             29 /**< SECALM_EXTSWARN5_FL Position */
#define MXC_F_SMON_SECALM_EXTSWARN5_FL                 ((uint32_t)(0x1UL << MXC_F_SMON_SECALM_EXTSWARN5_FL_POS)) /**< SECALM_EXTSWARN5_FL Mask */

/**@} end of group SMON_SECALM_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_SECDIAG SMON_SECDIAG
 * @brief    Security Diagnostic Register.
 * @{
 */
#define MXC_F_SMON_SECDIAG_POR_FL_POS                  0 /**< SECDIAG_POR_FL Position */
#define MXC_F_SMON_SECDIAG_POR_FL                      ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_POR_FL_POS)) /**< SECDIAG_POR_FL Mask */

#define MXC_F_SMON_SECDIAG_SHIELD_FL_POS               2 /**< SECDIAG_SHIELD_FL Position */
#define MXC_F_SMON_SECDIAG_SHIELD_FL                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_SHIELD_FL_POS)) /**< SECDIAG_SHIELD_FL Mask */

#define MXC_F_SMON_SECDIAG_LOTEMP_FL_POS               3 /**< SECDIAG_LOTEMP_FL Position */
#define MXC_F_SMON_SECDIAG_LOTEMP_FL                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_LOTEMP_FL_POS)) /**< SECDIAG_LOTEMP_FL Mask */

#define MXC_F_SMON_SECDIAG_HITEMP_FL_POS               4 /**< SECDIAG_HITEMP_FL Position */
#define MXC_F_SMON_SECDIAG_HITEMP_FL                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_HITEMP_FL_POS)) /**< SECDIAG_HITEMP_FL Mask */

#define MXC_F_SMON_SECDIAG_BATLO_FL_POS                5 /**< SECDIAG_BATLO_FL Position */
#define MXC_F_SMON_SECDIAG_BATLO_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_BATLO_FL_POS)) /**< SECDIAG_BATLO_FL Mask */

#define MXC_F_SMON_SECDIAG_BATHI_FL_POS                6 /**< SECDIAG_BATHI_FL Position */
#define MXC_F_SMON_SECDIAG_BATHI_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_BATHI_FL_POS)) /**< SECDIAG_BATHI_FL Mask */

#define MXC_F_SMON_SECDIAG_DYNS_FL_POS                 7 /**< SECDIAG_DYNS_FL Position */
#define MXC_F_SMON_SECDIAG_DYNS_FL                     ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_DYNS_FL_POS)) /**< SECDIAG_DYNS_FL Mask */

#define MXC_F_SMON_SECDIAG_AESKT_MEU_POS               8 /**< SECDIAG_AESKT_MEU Position */
#define MXC_F_SMON_SECDIAG_AESKT_MEU                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_AESKT_MEU_POS)) /**< SECDIAG_AESKT_MEU Mask */

#define MXC_F_SMON_SECDIAG_AESKT_MEMPROT_XIP_POS       9 /**< SECDIAG_AESKT_MEMPROT_XIP Position */
#define MXC_F_SMON_SECDIAG_AESKT_MEMPROT_XIP           ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_AESKT_MEMPROT_XIP_POS)) /**< SECDIAG_AESKT_MEMPROT_XIP Mask */

#define MXC_F_SMON_SECDIAG_KEY0_ZERO_POS               10 /**< SECDIAG_KEY0_ZERO Position */
#define MXC_F_SMON_SECDIAG_KEY0_ZERO                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_KEY0_ZERO_POS)) /**< SECDIAG_KEY0_ZERO Mask */

#define MXC_F_SMON_SECDIAG_KEY1_ZERO_POS               11 /**< SECDIAG_KEY1_ZERO Position */
#define MXC_F_SMON_SECDIAG_KEY1_ZERO                   ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_KEY1_ZERO_POS)) /**< SECDIAG_KEY1_ZERO Mask */

#define MXC_F_SMON_SECDIAG_DFD_FL_POS                  15 /**< SECDIAG_DFD_FL Position */
#define MXC_F_SMON_SECDIAG_DFD_FL                      ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_DFD_FL_POS)) /**< SECDIAG_DFD_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS0_FL_POS                16 /**< SECDIAG_EXTS0_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS0_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS0_FL_POS)) /**< SECDIAG_EXTS0_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS1_FL_POS                17 /**< SECDIAG_EXTS1_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS1_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS1_FL_POS)) /**< SECDIAG_EXTS1_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS2_FL_POS                18 /**< SECDIAG_EXTS2_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS2_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS2_FL_POS)) /**< SECDIAG_EXTS2_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS3_FL_POS                19 /**< SECDIAG_EXTS3_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS3_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS3_FL_POS)) /**< SECDIAG_EXTS3_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS4_FL_POS                20 /**< SECDIAG_EXTS4_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS4_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS4_FL_POS)) /**< SECDIAG_EXTS4_FL Mask */

#define MXC_F_SMON_SECDIAG_EXTS5_FL_POS                21 /**< SECDIAG_EXTS5_FL Position */
#define MXC_F_SMON_SECDIAG_EXTS5_FL                    ((uint32_t)(0x1UL << MXC_F_SMON_SECDIAG_EXTS5_FL_POS)) /**< SECDIAG_EXTS5_FL Mask */

/**@} end of group SMON_SECDIAG_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_DLRTC SMON_DLRTC
 * @brief    DRS Log RTC Value. This register contains the 32 bit value in the RTC second
 *           register when the last DRS event occurred.
 * @{
 */
#define MXC_F_SMON_DLRTC_DLRTC_POS                     0 /**< DLRTC_DLRTC Position */
#define MXC_F_SMON_DLRTC_DLRTC                         ((uint32_t)(0xFFFFFFFFUL << MXC_F_SMON_DLRTC_DLRTC_POS)) /**< DLRTC_DLRTC Mask */

/**@} end of group SMON_DLRTC_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_MEUCTRL SMON_MEUCTRL
 * @brief    MEU Configuration
 * @{
 */
#define MXC_F_SMON_MEUCTRL_ENC_EN_POS                  0 /**< MEUCTRL_ENC_EN Position */
#define MXC_F_SMON_MEUCTRL_ENC_EN                      ((uint32_t)(0x7FUL << MXC_F_SMON_MEUCTRL_ENC_EN_POS)) /**< MEUCTRL_ENC_EN Mask */

#define MXC_F_SMON_MEUCTRL_LOCK_POS                    31 /**< MEUCTRL_LOCK Position */
#define MXC_F_SMON_MEUCTRL_LOCK                        ((uint32_t)(0x1UL << MXC_F_SMON_MEUCTRL_LOCK_POS)) /**< MEUCTRL_LOCK Mask */

/**@} end of group SMON_MEUCTRL_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_SECST SMON_SECST
 * @brief    Security Monitor Status Register.
 * @{
 */
#define MXC_F_SMON_SECST_EXTSCTRL_ST_POS               0 /**< SECST_EXTSCTRL_ST Position */
#define MXC_F_SMON_SECST_EXTSCTRL_ST                   ((uint32_t)(0x1UL << MXC_F_SMON_SECST_EXTSCTRL_ST_POS)) /**< SECST_EXTSCTRL_ST Mask */

#define MXC_F_SMON_SECST_INTSCTRL_ST_POS               1 /**< SECST_INTSCTRL_ST Position */
#define MXC_F_SMON_SECST_INTSCTRL_ST                   ((uint32_t)(0x1UL << MXC_F_SMON_SECST_INTSCTRL_ST_POS)) /**< SECST_INTSCTRL_ST Mask */

#define MXC_F_SMON_SECST_SECALM_ST_POS                 2 /**< SECST_SECALM_ST Position */
#define MXC_F_SMON_SECST_SECALM_ST                     ((uint32_t)(0x1UL << MXC_F_SMON_SECST_SECALM_ST_POS)) /**< SECST_SECALM_ST Mask */

#define MXC_F_SMON_SECST_MEUCTRL_ST_POS                7 /**< SECST_MEUCTRL_ST Position */
#define MXC_F_SMON_SECST_MEUCTRL_ST                    ((uint32_t)(0x1UL << MXC_F_SMON_SECST_MEUCTRL_ST_POS)) /**< SECST_MEUCTRL_ST Mask */

/**@} end of group SMON_SECST_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_SDBE SMON_SDBE
 * @brief    Security Monitor Self Destruct Byte.
 * @{
 */
#define MXC_F_SMON_SDBE_SDBYTE_POS                     0 /**< SDBE_SDBYTE Position */
#define MXC_F_SMON_SDBE_SDBYTE                         ((uint32_t)(0xFFUL << MXC_F_SMON_SDBE_SDBYTE_POS)) /**< SDBE_SDBYTE Mask */

#define MXC_F_SMON_SDBE_SDBYTE_EN_POS                  31 /**< SDBE_SDBYTE_EN Position */
#define MXC_F_SMON_SDBE_SDBYTE_EN                      ((uint32_t)(0x1UL << MXC_F_SMON_SDBE_SDBYTE_EN_POS)) /**< SDBE_SDBYTE_EN Mask */

/**@} end of group SMON_SDBE_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32572_INCLUDE_SMON_REGS_H_
